In [44]:
import pandas as pd
import numpy as np

In [8]:
run_times = pd.read_excel('data/Run Times.xlsx')  # or 'xlrd'

run_times

,Name,Run Time,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
0,Alexis,9.2343,3.5,“school”,2023-04-15 12:00:00,2023-06-01,False,$0.00
1,Alexis,10.3842,3.5,School,2023-04-22 12:30:00,2023-06-01,True,$0.00
2,Alexis,8.1209,3 min,“the gym”,2023-05-10 15:00:00,2023-06-01,False,$2.50
3,David,7.2123,2.2,“school”,2023-05-01 15:15:00,2023-06-15,False,$0.00
4,David,6.8342,2,“gym”,2023-05-10 16:30:00,2023-06-15,False,$2.50

In [9]:
run_times.dtypes

Name                    object
Run Time               float64
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                     object
dtype: object

In [10]:
run_times.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          5 non-null      object
 1   Run Time      5 non-null      float64
 2   Warm Up Time  5 non-null      object
 3   Location      5 non-null      object
 4   Run Date      5 non-null      datetime64[ns]
 5   Race Date     5 non-null      datetime64[ns]
 6   Rain          5 non-null      bool
 7   Fee           5 non-null      object
dtypes: bool(1), datetime64[ns](2), float64(1), object(4)
memory usage: 417.0+ bytes

In [11]:
 run_times.head()

,Name,Run Time,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
0,Alexis,9.2343,3.5,“school”,2023-04-15 12:00:00,2023-06-01,False,$0.00
1,Alexis,10.3842,3.5,School,2023-04-22 12:30:00,2023-06-01,True,$0.00
2,Alexis,8.1209,3 min,“the gym”,2023-05-10 15:00:00,2023-06-01,False,$2.50
3,David,7.2123,2.2,“school”,2023-05-01 15:15:00,2023-06-15,False,$0.00
4,David,6.8342,2,“gym”,2023-05-10 16:30:00,2023-06-15,False,$2.50

In [25]:
pd.to_numeric(run_times.Fee.astype(str).str.replace('$',''))

0    0.0
1    0.0
2    2.5
3    0.0
4    2.5
Name: Fee, dtype: float64

In [27]:
run_times.dtypes

Name                    object
Run Time               float64
Warm Up Time            object
Location                object
Run Date        datetime64[ns]
Race Date       datetime64[ns]
Rain                      bool
Fee                    float64
dtype: object

In [30]:
pd.to_numeric(run_times['Warm Up Time'], errors='coerce')

0    3.5
1    3.5
2    NaN
3    2.2
4    2.0
Name: Warm Up Time, dtype: float64

In [36]:
pd.to_numeric(run_times['Warm Up Time'].astype(str).str.replace(' min',''))

0    3.5
1    3.5
2    3.0
3    2.2
4    2.0
Name: Warm Up Time, dtype: float64

In [38]:
run_times.head()

,Name,Run Time,Warm Up Time,Location,Run Date,Race Date,Rain,Fee
0,Alexis,9.2343,3.5,“school”,2023-04-15 12:00:00,2023-06-01,False,0.0
1,Alexis,10.3842,3.5,School,2023-04-22 12:30:00,2023-06-01,True,0.0
2,Alexis,8.1209,3 min,“the gym”,2023-05-10 15:00:00,2023-06-01,False,2.5
3,David,7.2123,2.2,“school”,2023-05-01 15:15:00,2023-06-15,False,0.0
4,David,6.8342,2,“gym”,2023-05-10 16:30:00,2023-06-15,False,2.5

In [39]:
run_times.Rain.astype('int')

0    0
1    1
2    0
3    0
4    0
Name: Rain, dtype: int64

MISSING DATA

In [43]:
df=pd.read_excel('data/Student Grades.xlsx')
df.tail()

    Student Class    Year  Grade
81      NaN   NaN     NaN    NaN
82  Bennett   NaN     NaN    NaN
83      NaN   EDA  Junior   84.0
84    Gavin   EDA  Senior    NaN
85   Calvin   NaN     NaN  100.0

In [47]:
np.nan

nan

In [49]:
pd.NA

In [50]:
None

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  84 non-null     object
 1   Class    83 non-null     object
 2   Year     80 non-null     object
 3   Grade    82 non-null     float64
dtypes: float64(1), object(3)
memory usage: 2.8+ KB

In [54]:
df.Year.value_counts(dropna=False)

Year
Freshman     35
Sophomore    24
Junior       20
NaN           6
Senior        1
Name: count, dtype: int64

In [56]:
df.isna().sum()

Student    2
Class      3
Year       6
Grade      4
dtype: int64

In [58]:
df[df.isna().any(axis=1)]

    Student                      Class    Year  Grade
7     Jacob           Freshman Seminar     NaN   88.0
8   William           Freshman Seminar     NaN   89.0
9     Ethan           Freshman Seminar     NaN   86.0
62   Landon  Exploratory Data Analysis  Junior    NaN
81      NaN                        NaN     NaN    NaN
82  Bennett                        NaN     NaN    NaN
83      NaN                        EDA  Junior   84.0
84    Gavin                        EDA  Senior    NaN
85   Calvin                        NaN     NaN  100.0

In [59]:
df.dropna(subset=['Student', 'Class'], inplace=True)

    Student                      Class    Year  Grade
7     Jacob           Freshman Seminar     NaN   88.0
8   William           Freshman Seminar     NaN   89.0
9     Ethan           Freshman Seminar     NaN   86.0
62   Landon  Exploratory Data Analysis  Junior    NaN
84    Gavin                        EDA  Senior    NaN

In [63]:
df.shape

(86, 4)

In [64]:
df[df.Grade.isna()]

    Student                      Class    Year  Grade
62   Landon  Exploratory Data Analysis  Junior    NaN
81      NaN                        NaN     NaN    NaN
82  Bennett                        NaN     NaN    NaN
84    Gavin                        EDA  Senior    NaN

In [65]:
df.Grade.mean()

np.float64(85.70731707317073)

In [67]:
df.Grade.fillna(df.Grade.mean(), inplace=True)

In [68]:
df[df.isna().any(axis=1)]

    Student             Class    Year       Grade
7     Jacob  Freshman Seminar     NaN   88.000000
8   William  Freshman Seminar     NaN   89.000000
9     Ethan  Freshman Seminar     NaN   86.000000
81      NaN               NaN     NaN   85.707317
82  Bennett               NaN     NaN   85.707317
83      NaN               EDA  Junior   84.000000
85   Calvin               NaN     NaN  100.000000

In [74]:
df[df.Class=='Freshman Seminar']

     Student             Class      Year  Grade
0       Emma  Freshman Seminar  Freshman   86.0
1     Olivia  Freshman Seminar  Freshman   86.0
2       Noah  Freshman Seminar  Freshman   86.0
3     Sophia  Freshman Seminar  Freshman   87.0
4       Liam  Freshman Seminar  Freshman   90.0
5      Mason  Freshman Seminar  Freshman   90.0
6   Isabella  Freshman Seminar  Freshman   90.0
7      Jacob  Freshman Seminar  Freshman   88.0
8    William  Freshman Seminar       NaN   89.0
9      Ethan  Freshman Seminar       NaN   86.0
10       Ava  Freshman Seminar  Freshman   88.0
11   Michael  Freshman Seminar  Freshman   88.0

In [73]:
df.loc[7, 'Year']="Freshman"

In [76]:
df.Year= np.where(df.Year.isna(), 'Freshman', df.Year)
df

    Student             Class      Year       Grade
0      Emma  Freshman Seminar  Freshman   86.000000
1    Olivia  Freshman Seminar  Freshman   86.000000
2      Noah  Freshman Seminar  Freshman   86.000000
3    Sophia  Freshman Seminar  Freshman   87.000000
4      Liam  Freshman Seminar  Freshman   90.000000
..      ...               ...       ...         ...
81      NaN               NaN  Freshman   85.707317
82  Bennett               NaN  Freshman   85.707317
83      NaN               EDA    Junior   84.000000
84    Gavin               EDA    Senior   85.707317
85   Calvin               NaN  Freshman  100.000000

[86 rows x 4 columns]

# INCONSISTENT TEXT & TYPOS

In [77]:
df.head()

  Student             Class      Year  Grade
0    Emma  Freshman Seminar  Freshman   86.0
1  Olivia  Freshman Seminar  Freshman   86.0
2    Noah  Freshman Seminar  Freshman   86.0
3  Sophia  Freshman Seminar  Freshman   87.0
4    Liam  Freshman Seminar  Freshman   90.0

In [78]:
df.Class.value_counts()

Class
Intro to Python              25
Intro to SQL                 20
EDA                          13
Freshman Seminar             12
Exploratory Data Analysis    12
Python                        1
Name: count, dtype: int64

In [80]:
df[df.Class.isin(['Exploratory Data Analysis', 'EDA'])]

      Student                      Class       Year       Grade
58     Evelyn  Exploratory Data Analysis  Sophomore   89.000000
59       Jack  Exploratory Data Analysis  Sophomore   84.000000
60       Ella  Exploratory Data Analysis  Sophomore  200.000000
61      Chloe  Exploratory Data Analysis  Sophomore   87.000000
62     Landon  Exploratory Data Analysis     Junior   85.707317
63  Christian  Exploratory Data Analysis     Junior   77.000000
64     Jordan  Exploratory Data Analysis     Junior   83.000000
65   Jonathan  Exploratory Data Analysis     Junior   82.000000
66       Levi  Exploratory Data Analysis     Junior   91.000000
67   Victoria  Exploratory Data Analysis     Junior   90.000000
68     Aubrey  Exploratory Data Analysis     Junior   83.000000
69      Jaxon  Exploratory Data Analysis     Junior   64.000000
70     Julian                        EDA     Junior   95.000000
71      Grace                        EDA     Junior   77.000000
72     Isaiah                        EDA     Junior   88.000000
73    Cameron                        EDA     Junior   72.000000
74        Eli                        EDA     Junior   92.000000
75      Angel                        EDA     Junior   79.000000
76       Zoey                        EDA     Junior   91.000000
77      Aaron                        EDA     Junior   85.000000
78    Charles                        EDA     Junior   93.000000
79     Connor                        EDA     Junior   91.000000
80      Riley                        EDA     Junior   87.000000
83        NaN                        EDA     Junior   84.000000
84      Gavin                        EDA     Senior   85.707317

In [81]:
df[df.Class.isin(['Intro to Python', 'Python'])]

      Student            Class      Year  Grade
12  Alexander  Intro to Python  Freshman   85.0
13      Logan  Intro to Python  Freshman   85.0
14      James  Intro to Python  Freshman   82.0
15     Daniel  Intro to Python  Freshman   85.0
16     Elijah  Intro to Python  Freshman   85.0
17   Benjamin  Intro to Python  Freshman   81.0
18        Mia  Intro to Python  Freshman   80.0
19        Mia           Python  Freshman   80.0
20     Jayden  Intro to Python  Freshman   82.0
21      Aiden  Intro to Python  Freshman   86.0
22    Matthew  Intro to Python  Freshman   87.0
23      Emily  Intro to Python  Freshman   78.0
24    Jackson  Intro to Python  Freshman   88.0
25      Lucas  Intro to Python  Freshman   77.0
26      David  Intro to Python  Freshman   74.0
27     Joseph  Intro to Python  Freshman   93.0
28    Abigail  Intro to Python  Freshman   89.0
29      Avery  Intro to Python  Freshman   79.0
30    Anthony  Intro to Python  Freshman   84.0
31      Dylan  Intro to Python  Freshman   84.0
32     Andrew  Intro to Python  Freshman   94.0
33     Carter  Intro to Python  Freshman   95.0
34     Samuel  Intro to Python  Freshman   83.0
35    Gabriel  Intro to Python  Freshman   82.0
36     Joshua  Intro to Python  Freshman   71.0
37       John  Intro to Python  Freshman   50.0

In [82]:
df.Year.value_counts()

Year
Freshman     41
Sophomore    24
Junior       20
Senior        1
Name: count, dtype: int64

In [83]:
df.Grade.describe()

count     86.000000
mean      85.707317
std       15.157594
min       45.000000
25%       81.000000
50%       85.707317
75%       89.750000
max      200.000000
Name: Grade, dtype: float64

In [84]:
df[df.Grade>100]

   Student                      Class       Year  Grade
60    Ella  Exploratory Data Analysis  Sophomore  200.0

In [88]:
df.Class= np.where(df.Class=='EDA', 'Exploratory Data Analysis', df.Class)
df.Class

0              Freshman Seminar
1              Freshman Seminar
2              Freshman Seminar
3              Freshman Seminar
4              Freshman Seminar
                ...
81                          NaN
82                          NaN
83    Exploratory Data Analysis
84    Exploratory Data Analysis
85                          NaN
Name: Class, Length: 86, dtype: object

In [89]:
df.Class.value_counts()

Class
Intro to Python              25
Exploratory Data Analysis    25
Intro to SQL                 20
Freshman Seminar             12
Python                        1
Name: count, dtype: int64

In [90]:
df.Class= np.where(df.Class=='Python', 'Intro to Python', df.Class)
df.Class

0              Freshman Seminar
1              Freshman Seminar
2              Freshman Seminar
3              Freshman Seminar
4              Freshman Seminar
                ...
81                          NaN
82                          NaN
83    Exploratory Data Analysis
84    Exploratory Data Analysis
85                          NaN
Name: Class, Length: 86, dtype: object

In [91]:
df.Class.value_counts()

Class
Intro to Python              26
Exploratory Data Analysis    25
Intro to SQL                 20
Freshman Seminar             12
Name: count, dtype: int64

In [95]:
df.Grade= np.where(df.Grade>100, 100, df.Grade)
df.Grade

0      86.000000
1      86.000000
2      86.000000
3      87.000000
4      90.000000
         ...
81     85.707317
82     85.707317
83     84.000000
84     85.707317
85    100.000000
Name: Grade, Length: 86, dtype: float64

In [93]:
df.Grade.describe()

count     86.000000
mean      85.707317
std       15.157594
min       45.000000
25%       81.000000
50%       85.707317
75%       89.750000
max      200.000000
Name: Grade, dtype: float64

# #CLEANING TEXT

In [97]:
#string leading and trailing characters
run_times.Location.str.strip('"')

0     “school”
1       School
2    “the gym”
3     “school”
4        “gym”
Name: Location, dtype: object

In [98]:
run_times.Location.str.strip('"').str.lower()

0     “school”
1       school
2    “the gym”
3     “school”
4        “gym”
Name: Location, dtype: object

In [99]:
#replace or remove characterss
run_times.Location.str.strip('"').str.lower().str.replace('the', '')

0    “school”
1      school
2      “ gym”
3    “school”
4       “gym”
Name: Location, dtype: object

In [106]:
run_times.Location= run_times.Location.str.strip('"').str.lower().str.replace('the', '').str.strip('“”')